In [3]:
import opendatasets as od

In [7]:
od.download("https://www.kaggle.com/datasets/brendan45774/countries-life-expectancy")

Please provide your Kaggle credentials to download this dataset. Learn more: http://bit.ly/kaggle-creds
Your Kaggle username:

  shivanipal123

Your Kaggle Key:

  ········

Downloading countries-life-expectancy.zip to .\countries-life-expectancy

100%|██████████████████████████████████████████████████████████████████████████████| 17.2k/17.2k [00:00<00:00, 185kB/s]

In [1]:
import os

In [2]:
data_dir = '.\countries-life-expectancy'

In [3]:
os.listdir(data_dir)

['Life expectancy.csv']

In [4]:
import pandas as pd

In [6]:
df=pd.read_csv('countries-life-expectancy/Life expectancy.csv')

In [18]:
df.head()

      Entity  Year  Life expectancy
0  Australia  1802        34.049999
1  Australia  1803        34.049999
2  Australia  1804        34.049999
3  Australia  1805        34.049999
4  Australia  1806        34.049999

In [19]:
df.describe()

              Year  Life expectancy
count  3253.000000      3253.000000
mean   1908.066093        48.680380
std      62.613962        17.965669
min    1800.000000         8.108836
25%    1854.000000        32.000000
50%    1908.000000        41.880001
75%    1962.000000        66.820000
max    2016.000000        83.940002

In [12]:
import opendatasets as od

In [13]:
od.download('https://www.kaggle.com/datasets/mirichoi0218/insurance')

Please provide your Kaggle credentials to download this dataset. Learn more: http://bit.ly/kaggle-creds
Your Kaggle username:

  shivanipal123

Your Kaggle Key:

  ········

Downloading insurance.zip to .\insurance

100%|██████████████████████████████████████████████████████████████████████████████| 16.0k/16.0k [00:00<00:00, 241kB/s]

In [14]:
import pandas as pd

In [15]:
ins_df=pd.read_csv("insurance/insurance.csv")

In [16]:
ins_df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [17]:
ins_df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010